Требуется вывести на веб-страницу данные о товарах, соответствующие вашему номеру варианта. 
Нужно вывести основную информацию о каждой записи, включая фотографию, а также ссылку на подробную информацию на яндекс-маркете. 
Также вывести дополнительную информацию, указанную в вашем варианте.
Изменять исходный массив данных нельзя. Код должен сохранять работоспособность при добавлении/удалении данных из массива.
Вариант 1
Вывести прайс-лист на принтеры (см. исходные данные в директории 01-printers) в порядке возрастанию цены.
Вывести среднюю цену по каждому производителю.

Вариант 2
Вывести прайс-лист на телефоны (см. исходные данные в директории 02-phones) с сортировкой по производителю — телефоны одного 
производителя должны идти подряд, порядок в рамках одного производителя произвольный.
В конце отдельно продублировать вариант с самым высоким рейтингом.

Вариант 3
Вывести прайс-лист на навигаторы (см. исходные данные в директории 03-navigators) в порядке убывания рейтинга.
Выделить цветом 3 самых дорогих варианта.

Вариант 4
Вывести прайс-лист на мотокультиваторы (см. исходные данные в директории 04-cultivators) в порядке возрастания цены.
Вывести отдельно список производителей и количество предложений по каждому из них.

Вариант 5
Вывести прайс-лист на веб-камеры (см. исходные данные в директории 05-cameras) в порядке убывания рейтинга.
В начале списка отдельно вывести фотографию варианта с самой низкой ценой.

Вариант 6
Вывести прайс-лист на планшетные ПК (см. исходные данные в директории 06-tables) в порядке убывания рейтинга. 
Отдельно вывести, сколько всего предложений с рейтингом 3, сколько всего с рейтингом 4, сколько всего с рейтингом 5 
(округляя рейтинг каждого варианта до целого в меньшую сторону).

Вариант 7
Вывести прайс-лист на телевизоры (см. исходные данные в директории 07-tv) в порядке убывания диагонали монитора.

Вариант 8
Вывести прайс-лист на ноутбуки (см. исходные данные в директории 08-notebooks) в порядке убывания рейтинга, 
выделить цветом те, у которых цена меньше средней.

Вариант 9
Вывести прайс-лист на мониторы (см. исходные данные в директории 09-monitors) в порядке возрастания цены, 
причем фотографию выводить только для тех, у которых рейтинг не меньше 4,5.

Вариант 10
Вывести прайс-лист на аудиосистемы (см. исходные данные в директории 10-audio) в порядке убывания цены. 
Выделить цветом модель с самым высоким рейтингом, модель с самым низким рейтингом.

Вариант 11
Вывести прайс-лист на принтеры (см. исходные данные в директории 01-printers) в порядке. 
Отдельно вывести список производителей и средний рейтинг каждого.

Вариант 12
Вывести прайс-лист на телефоны (см. исходные данные в директории 02-phones). 
Отдельно вывести названия тех производителей, у которых есть хотя бы один вариант, у которого рейтинг не меньше четырех.

Вариант 13
Вывести прайс-лист на навигаторы (см. исходные данные в директории 03-navigators). 
Отдельно вывести список производителей с указанием минимальной цены для каждого.

Вариант 14
Вывести прайс-лист на мотокультиваторы и мотоблоки (см. исходные данные в директории 04-cultivators) в порядке возрастания цены. 
Выделить цветом мотоблоки.

Вариант 15
Вывести прайс-лист на веб-камеры (см. исходные данные в директории 05-cameras) в порядке убывания рейтинга. 
Отдельно вывести список производителей и для каждого цену самой дорогой модели.

Вариант 16
Вывести прайс-лист на планшетные ПК (см. исходные данные в директории 06-tables) в порядке возрастания цены. 
Выделить цветом предложения того производителя, у которого больше всего предложений в списке.

Вариант 17
Вывести прайс-лист на телевизоры (см. исходные данные в директории 07-tv) в порядке убывания рейтинга. 
Выделить цветом предложение, если оно единственное у данного производителя.


Варианты:


Ажимов Тимерхан    1

Баулина Кристина    2

Босенок Екатерина    3

Волков Михаил    4

Зацепина Дарья    5

Максимова Олеся    6

Михеева Тамара    7

Николаенко Никита    8

Осинцева Анастасия    9

Полежаева Александра    10

Селиванов Андрей    11

Синдикаева Антонина    12

Синютина Александра    13

Сиротин Александр    14

Шевченко Любовь    15

Шубина Алина    16